Repository: DevelopCubeLab/CellularInfo
Catalog: CellularInfo/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: 4G Network Indicator: %@
zh_hans: 4G网络标识: %@

# 5GAdvancedConnected
source: 5G-Advanced: %@
zh_hans: 5GA: %@

# 5GAdvancedConnectedHint
source: The current system version may not correctly recognize or display 5G Advanced (5GA) networks status, and related data may be unavailable or inaccurate.
zh_hans: 当前系统版本可能无法正确识别或显示5G Advanced (5GA)网络状态，相关数据可能缺失或不准确。

# 5GAdvancedNetworkIndicator
source: 5G-Advanced or 5G mmWave Network Indicator: %@
zh_hans: 5GA网络标识: %@

source: 5G Auto: %@
zh_hans: 自动5G: %@

source: A-GPS
zh_hans: A-GPS辅助定位

source: About
zh_hans: 关于

# AbsentSIMTray
source: No physical SIM tray
zh_hans: 无实体卡槽

source: Acknowledgements
zh_hans: 致谢

source: Active Cellular Services: %@
zh_hans: 当前使用的蜂窝服务: %@

source: Active Data Plan: %@
zh_hans: 默认数据流量: %@

source: Alert
zh_hans: 提示

# Allow2GSwitch
source: Turn on 2G network: %@
zh_hans: 开启2G网络: %@

# AllowCellularDataAPNEditing
source: Additional APN configuration: %@
zh_hans: 附加APN配置: %@

source: Allowed
zh_hans: 允许

# AllowInstallDevSignedCarrierBundles
source: Install Dev Signed IPCC: %@
zh_hans: 安装开发签名的IPCC: %@

# AllowInstallEmbeddedSIM
source: Install eSIM: %@
zh_hans: 安装eSIM: %@

# AllowInstallEmbeddedSIMHint
source: Uses official system APIs to check whether this device is allowed to install an eSIM. The result may take a few seconds to appear. If data acquisition is abnormal, please restart the application and try again.
zh_hans: 通过官方接口查询设备的激活策略是否允许安装 eSIM，获取结果通常需要几秒钟时间。 如果数据获取异常，您可以重新启动应用程序后再试一次

source: Already Selected
zh_hans: 已设定

source: Always On
zh_hans: 始终开启

source: Any Network Type
zh_hans: 任意网络类型

source: APN
zh_hans: 接入点名称

# APNAllowedProtocol
source: APN Protocol
zh_hans: APN协议

# APNAllowRadioTechnology
source: APN allow network type
zh_hans: APN允许的网络类型

# APNInactivityTimer
source: Inactivity Timer
zh_hans: 空闲断开

source: APN Roaming Protocol
zh_hans: APN漫游协议

source: APN Settings
zh_hans: 接入点名称(APN)

# APNSettingsList
source: APN Settings: %@
zh_hans: 接入点名称(APN): %@

# APNSupport5GSaHandover
source: Support 5G SA Handover
zh_hans: 支持5G SA切换

# APNSupportSwitchNetworkType
source: Support Switch Network Type
zh_hans: 支持网络类型切换

source: APN Type
zh_hans: APN类型

# AppIconSettings
source: App Icons
zh_hans: 应用图标

source: Automatic
zh_hans: 自动

source: Automatic Select Network Mode
zh_hans: 自动选择网络类型

source: Auto Refresh Data
zh_hans: 自动刷新数据

# BandInfo
source: Network Active Bands: %1$@ Device Supported Bands: %2$@
zh_hans: 网络可用的频段: %1$@ 设备支持的频段: %2$@

# BandInformation
source: Band Info: %@
zh_hans: 频段信息: %@

source: Bandwidth: %@
zh_hans: 频宽: %@

source: Baseband Activation Ticket
zh_hans: 基带激活信息

source: Baseband Activation Ticket Manager
zh_hans: 基带激活信息管理

source: Baseband Release Candidate Flag: %@
zh_hans: 基带候选(RC)版本固件: %@

# BasebandReleaseCandidateFlagHint
source: Indicates whether the device is in a Release Candidate (RC) state at the baseband or carrier configuration level. This flag is not related to iOS system versions and is believed to be used only in Apple's internal or carrier testing workflows. On retail devices, it is typically always disabled. There is currently no known method to trigger or reproduce this state on consumer devices.
zh_hans: 当前设备是否处于基带或运营商配置的 RC（候选发布）阶段。该标志与 iOS 系统版本无关，推测仅用于 Apple 内部或运营商测试流程。在零售设备上通常始终为未启用。 目前尚无已知方法触发或复现该状态。

# BasebandUniqueID
source: Baseband Chip ID: %@
zh_hans: 基带芯片组唯一标识符: %@

source: Basic
zh_hans: 基本

source: Below System Version
zh_hans: 低于系统版本

# BWPSupports
source: Supported (%@)
zh_hans: 支持 (%@)

source: Cancel
zh_hans: 取消

# CanDeletePlan
source: Delete: %@
zh_hans: 删除蜂窝数据卡: %@

# CanDisablePlan
source: Disable: %@
zh_hans: 禁用蜂窝数据卡: %@

source: Capability
zh_hans: 能力

source: Carrier Bookmarks
zh_hans: 运营商书签

# CarrierBookmarksHint
source: Carrier bookmarks are automatically added to Safari and you can manually remove them from the Safari Bookmark Manager.
zh_hans: 运营商的书签会自动添加到Safari浏览器中，您可以手动从Safari浏览器的书签管理器中删除它们

# CarrierBookmarksList
source: Carrier Bookmarks: %@
zh_hans: 运营商书签: %@

source: Carrier Bundle
zh_hans: 运营商配置文件

source: Carrier Bundle Details
zh_hans: 运营商配置文件详情

source: Carrier Bundle Location: %@
zh_hans: 运营商配置文件目录: %@

# CarrierBundleRuntimePathStatus
source: Carrier Bundle Directory: %@
zh_hans: 运营商配置文件目录: %@

# CarrierBundleShowNetworkSwitch
source: Show %1$@ Switcher: %2$@
zh_hans: 显示%1$@切换选项: %2$@

# CarrierBundleShowVoLTESwitch
source: Show VoLTE Switcher: %@
zh_hans: 显示VoLTE切换选项: %@

# CarrierBundleShowVoLTESwitchHint
source: This feature is controlled by the carrier and enabled by default. As 2G/3G networks have been phased out in some regions, this switch is not provided.
zh_hans: 该功能由运营商统一控制并默认开启。由于部分地区已关闭 2G/3G 网络，因此不提供此开关。

# CarrierBundleSupportsDevices
source: Supported Devices: %@
zh_hans: 支持的设备: %@

# CarrierBundleSupportsSIM
source: Supported SIMs: %@
zh_hans: 运营商配置支持的SIM: %@

# CarrierBundleSupportsSIMHint
source: Indicates the SIM matching rules supported by this carrier bundle (which may be based on IMSI, ICCID, GID1/GID2, or MCC/MNC), and does not represent the SIM currently inserted in the device.
zh_hans: 表示该运营商配置文件支持的SIM卡匹配规则（可能基于IMSI、ICCID、GID1/GID2或MCC/MNC等标识），并非当前设备插入的SIM卡。

source: Carrier Bundle Update Requires User Confirmation: %@
zh_hans: 运营商配置更新前需要用户确认: %@

# CarrierBundleVersion
source: iOS Carrier Profiles (IPCC) Version: %@
zh_hans: 运营商配置文件(IPCC)版本: %@

source: Carrier Disable VoLTE: %@
zh_hans: 运营商禁止使用VoLTE: %@

source: Carrier Lock: %@
zh_hans: 运营商锁: %@

source: Carrier Name: %@
zh_hans: 运营商名称: %@

source: Carrier Restricted
zh_hans: 运营商限制

source: Carrier Services
zh_hans: 运营商服务

source: Cell Info: %@
zh_hans: 网络小区信息: %@

source: Cellular
zh_hans: 蜂窝网络

source: Cellular Configuration
zh_hans: 蜂窝配置

source: Cellular Data Connection: %@
zh_hans: 蜂窝网络连接: %@

source: Cellular Data Disabled
zh_hans: 蜂窝数据未开启

# CellularDataStatus
source: Cellular Data: %@
zh_hans: 蜂窝数据: %@

# CellularPlanCount
source: Cellular Plan Count: %d
zh_hans: 蜂窝数据卡数量: %d

source: Cellular Plan Label: %@
zh_hans: 蜂窝数据卡标签: %@

source: Cellular Plan Name: %@
zh_hans: 蜂窝数据卡名称: %@

source: Cellular Plans
zh_hans: 蜂窝数据卡

source: Cellular Plan Transfer Capability: %@
zh_hans: 转移蜂窝套餐卡: %@

source: Cellular Status
zh_hans: 状态

source: Cellular Usage Workspace Info: %@
zh_hans: 蜂窝数据用量工作区信息: %@

# CFBundleDisplayName
source: Cellular Info
zh_hans: 蜂窝网络数据

# ChangeCellularPlanAlertMessage
source: Are you sure you want to %1$@ %2$@?
zh_hans: 确定%1$@%2$@?

# ChangeIconFailedMessage
source: Failed to change app icon. Please ensure the Bundle ID used for code signing matches the provisioning profile, otherwise the icon cannot be changed.
zh_hans: 切换应用图标失败，请确保证书签名时使用的 Bundle ID 与描述文件中的 Bundle ID 完全一致，否则无法切换图标。

# ChannelNumber
source: 4G (LTE) Downlink Channel Number(EARFCN DL): %@
zh_hans: 4G(LTE)下行信道编号(EARFCN DL): %@

# ChannelNumberHint
source: EARFCN DL(E-UTRA Absolute Radio Frequency Channel Number Downlink) Represents the standardized channel number for the LTE (4G) downlink frequency. This value can be used to determine the current frequency band (Band) and the corresponding actual downlink frequency (MHz). It is used for network identification and spectrum management, not for data encoding or signal strength. The channel number identifies the radio frequency used by the current cellular connection. Different technologies (LTE / 5G / 3G) use different numbering schemes.
zh_hans: EARFCN DL(E-UTRA Absolute Radio Frequency Channel Number Downlink) 表示 LTE（4G）网络下行频率的标准化信道编号。通过该编号可以确定当前连接的频段（Band）以及对应的实际下行频率（MHz）。该值用于网络识别与频谱管理，并非数据编码或信号强度指标。 信道号用于标识当前蜂窝连接所使用的无线频率，不同通信技术（如4G/5G/3G）使用不同的编号方式。

# CheckCarrierBundleCompatibilityBeforeInstall
source: Check IPCC Compatibility Before Install
zh_hans: 安装IPCC文件前检查兼容性

source: Check Completed
zh_hans: 检测完成

source: Checking…
zh_hans: 正在获取…

source: Checking Cellular Connectivity: %@
zh_hans: 正在检查蜂窝连接: %@

source: Chip
zh_hans: 芯片

source: Close
zh_hans: 关闭

source: Compatibility Check Result
zh_hans: 兼容性检测结果

source: Compatible
zh_hans: 兼容

# ConfigureNetworkBands
source: Configure Network Bands (Beta)
zh_hans: 设置网络频段(Beta)

# ConfigureNetworkBandsEntryTipsMessage
source: “Configure Network Bands” is currently a beta feature intended primarily for advanced users to manually adjust the device’s cellular network band configuration. Please note: ⚠️ Please configure the network bands according to the bands supported by your region and mobile carrier. Incorrect band settings may cause network issues, prevent the device from registering on the network, or result in “No Service.” If you encounter any issues, you can use “Restore Default Settings” to restore the device’s default network band configuration. ⚠️ Do not disable all bands for a particular network technology, as this may cause VoLTE, VoNR, voice calls, or SMS to malfunction. Once configured, the network band settings will remain in effect even after restarting the device. However, if you perform an IPCC update or Restore Default IPCC operation, the system will reapply the default network band configuration. This feature does not directly cause physical damage to the device hardware. However, incorrect network band settings may affect cellular connectivity and communication functions. Any risks arising from the use of this feature are assumed by the user. If you do not accept these risks, or if you opened this screen by mistake, please tap “Exit.” The application will automatically close this tool and hide its entry point.
zh_hans: “设置网络频段”目前为测试版功能，主要面向专业用户，用于手动调整设备的网络频段配置。 请注意： ⚠️ 请根据您所在区域及所使用运营商的网络频段配置进行设置。错误的频段设置可能导致网络异常、无法注册网络或出现“无服务”等情况。如遇到异常，可使用“恢复默认设置”恢复设备默认的网络频段配置。 ⚠️ 请勿取消某一网络制式的全部频段，否则可能导致 VoLTE、VoNR、语音通话或短信等功能异常。 设置完成后，即使重启设备，频段设置仍会保持。如果执行 IPCC 更新或恢复默认 IPCC 等操作，系统将重新应用默认的网络频段配置。 本功能不会直接对设备硬件造成物理损坏，但错误的网络频段设置可能影响设备的蜂窝网络及通信功能，相关风险需由用户自行承担。 如果您无法接受上述风险，或误进入当前界面，请点击“退出”。应用程序将自动关闭该工具并隐藏入口。

source: Confirm
zh_hans: 确定

# ConfirmInstallIPCCMessage
source: Do you want to install the IPCC file %1$@ (version %2$@)?
zh_hans: 是否安装%1$@ %2$@版本的IPCC文件?

# ConfirmInstallIPCCWithWarningMessage
source: The current IPCC file may be incompatible and it is not recommended to continue the installation. Do you want to install the IPCC file %1$@ (version %2$@)?
zh_hans: 当前的IPCC文件可能存在不兼容情况，不建议继续安装 是否安装%1$@ %2$@版本的IPCC文件?

source: Connected
zh_hans: 已连接

# ConnectionFailed
source: Failed to connect to baseband service
zh_hans: 连接基带服务失败

source: Connectivity Check
zh_hans: 检查连接服务

source: Continue
zh_hans: 继续

source: Continue Install
zh_hans: 继续安装

source: Copied
zh_hans: 已复制

source: Copy
zh_hans: 拷贝

# CopyActivationTicketMessage
source: The activation ticket has been copied to the clipboard. This data is only valid for the current device and cannot be used on other devices. Please keep it safe and consider backing it up to cloud storage or another location.
zh_hans: 基带激活信息已复制到剪贴板。该信息仅适用于当前设备，在其他设备上无法使用。请妥善保存，并建议备份至云服务或其他存储介质。

source: Copy Baseband Activation Ticket
zh_hans: 复制基带激活信息

# CurrentOSVersionNotSupported
source: Current System Version Not Supported
zh_hans: 当前系统版本不支持

source: Data Bearer: %@
zh_hans: 数据载体: %@

# DataInaccurate
source: Data is inaccurate
zh_hans: 数据可能不准确

source: Data Mode: %@
zh_hans: 数据模式: %@

source: Data Plan Provisioning
zh_hans: 蜂窝套餐配置

source: Data Roaming: %@
zh_hans: 数据漫游: %@

source: Data Roaming Disabled
zh_hans: 数据漫游已关闭

source: Data SIM Network Type: %@
zh_hans: 流量卡选择网络: %@

source: Dedicated Bearer: %@
zh_hans: 专用承载: %@

source: Default icon
zh_hans: 默认图标

source: Default network band restored
zh_hans: 已恢复默认网络频段

source: Default Voice: %@
zh_hans: 默认语音号码: %@

# DefaultVoiceSlot
source: Default Voice: %1$@ - %2$@
zh_hans: 默认语音号码: %1$@ - %2$@

source: Delete Carrier Bundle Failed
zh_hans: 删除IPCC失败

# DeleteCarrierBundleFailedWithReason
source: Delete Carrier Bundle Failed. %@
zh_hans: 删除IPCC失败, %@

# DeleteCarrierBundleMessage
source: Are you sure you want to delete the IPCC for %1$@ %2$@? This action cannot be undone.
zh_hans: 确定要删除%1$@ %2$@版本的 IPCC 吗? 此操作不可恢复

source: Delete Carrier Bundle Successful
zh_hans: 删除IPCC成功

source: Deselect All
zh_hans: 取消全选

source: Development Resources
zh_hans: 开发资源参考

source: Device Compatibility
zh_hans: 设备兼容性

source: Device Info
zh_hans: 设备信息

# DeviceInfoWithText
source: Device Info: %@
zh_hans: 设备信息: %@

source: Device Management
zh_hans: 设备管理

source: Device Not Supported
zh_hans: 设备不支持

# DeviceNotSupportedCellular
source: Cellular is not supported on this device.
zh_hans: 当前设备不支持蜂窝网络

# DeviceTypeAllocationCode
source: Device Type Allocation Code (TAC): %@
zh_hans: 设备型号代码(TAC): %@

# DeviceTypeAllocationCodeHint
source: The TAC(Type Allocation Code) is the first 8 digits of the IMEI and identifies the device model and manufacturer.
zh_hans: TAC（Type Allocation Code）是IMEI的前8位，用于识别设备型号和制造商信息。

# DeviceTypeMismatchMessage
source: ⚠️ Device type mismatch detected. Please do not modify the device type. This may lead to incorrect system behavior or abnormal data display.
zh_hans: ⚠️ 检测到设备类型不匹配。 请勿修改设备类型，这可能导致系统行为异常或数据显示不准确。

# DeviceUptime
source: Device uptime: %d days %d hours %d minutes
zh_hans: 设备已启动：%d天 %d小时 %d分钟

source: Diagnostics
zh_hans: 诊断

source: Disabled
zh_hans: 禁用

source: Display
zh_hans: 显示

source: Don’t Show Again
zh_hans: 不再提示

source: Downgrade Install
zh_hans: 降级安装

# DowngradeInstallIPCCMessage
source: An IPCC file for %1$@ is already installed. The selected IPCC version is lower than the currently installed version. IPCC file version: %2$@ Direct downgrade of the IPCC is not supported by the system. Continuing with the installation will cause the system to restore the carrier bundle to the default version. Do you want to continue with the installation?
zh_hans: 已经安装%1$@的IPCC文件 当前选择的IPCC文件低于已安装的IPCC版本 IPCC文件版本: %2$@ 系统不支持直接降级IPCC版本，继续安装此IPCC会导致系统恢复IPCC为系统默认版本 是否继续安装此IPCC文件？

# Downlink
source: Downlink (DL)
zh_hans: 下行(DL)

# DownlinkAndUplink
source: Downlink (DL) + Uplink (UL)
zh_hans: 下行(DL)+上行(UL)

source: Download Failed
zh_hans: 下载失败

# DownloadTrollSIMSwitcherMessage
source: Please select the method to download the TrollStore SIM Switcher
zh_hans: 请选择下载蜂窝切换器的网站

source: Drop to Check IPCC File Compatibility
zh_hans: 拖动到此处检测IPCC兼容性

source: Drop to Install IPCC
zh_hans: 拖动到此处安装IPCC

source: Dual SIM
zh_hans: 双卡

source: Dual Sim Capability: %@
zh_hans: 双卡能力: %@

source: Duplicate Install
zh_hans: 重复安装

source: Duplicate Install Check
zh_hans: 重复安装检测

# DuplicateInstallIPCCFileMessage
source: The IPCC file %1$@ (version %2$@) is already installed. Do you want to install it again?
zh_hans: 已经安装%1$@ %2$@版本的IPCC文件 是否再次安装此IPCC文件?

# DynamicDataSimSwitch
source: Allow Mobile Data Switching: %@
zh_hans: 允许切换蜂窝数据: %@

# DynamicDataSimSwitchOnCall
source: Allow Mobile Data Switching On Call: %@
zh_hans: 允许在通话时切换蜂窝数据: %@

# ECN0
source: Ec/No: %@ dB
zh_hans: 码片能量与噪声比(Ec/No): %@ dB

# ECN0Hint
source: Ec/No(Energy per chip over Noise density) measures the quality of the 3G signal by comparing signal energy to background noise. A higher value (closer to 0) means a cleaner and more stable signal.
zh_hans: Ec/No(Energy per chip over Noise density)码片能量与噪声比表示3G信号的质量，它反映信号与干扰噪声之间的比例。 数值越高（越接近 0），信号越清晰、越稳定。

# EmbeddedSIMHealth
source: eSIM Health: %@
zh_hans: eSIM 健康状况: %@

# EmbeddedSIMOnlyDevice
source: eSIM Only Device: %@
zh_hans: 设备仅支持eSIM: %@

# EmergencyModeInfo
source: Emergency Mode: %@
zh_hans: 紧急模式信息: %@

source: Emergency Services
zh_hans: 紧急呼叫服务

source: Emergency Text Numbers: %@
zh_hans: 允许紧急呼叫号码列表: %@

source: Empty
zh_hans: 无

source: Enabled
zh_hans: 启用

# EnableSettingsHint
source: Please enable '%@' in App Settings.
zh_hans: 请在App设置中开启’%@’

# ErrorWithCodeReason
source: Error %1$d: %2$@
zh_hans: 错误 %1$d: %2$@

source: eSIM Provisioning Service
zh_hans: eSIM配置下载服务

source: Exit
zh_hans: 退出

source: Experimental Features
zh_hans: 实验性功能

source: Export
zh_hans: 导出

# ExportCarrierBundleFailed
source: Failed to Export IPCC
zh_hans: 导出IPCC失败

# ExportCarrierBundleMessage
source: Do you want to export the IPCC for %1$@ (version %2$@)?
zh_hans: 确定导出%1$@ %2$@版本的IPCC?

source: FaceTime Authentication
zh_hans: FaceTime激活与验证服务

source: Factory Debug Mode: %@
zh_hans: 工厂调试模式: %@

# FactoryDebugModeHit
source: Indicates an internal flag showing whether the device is in factory debug and test mode. Unfortunately, the method to enable this mode is unknown.
zh_hans: 显示设备是否处于工厂调试模式的内部标识，遗憾的是我们并不知道如何启用它

# FailedRestoreDefaultNetworkBand
source: Failed to restore default network band
zh_hans: 恢复默认网络频段失败

source: Fetching…
zh_hans: 正在获取…

source: File not found
zh_hans: 文件不存在

# GlobalSynchronizationChannelNumber
source: GSCN: %@
zh_hans: 同步信道编号(GSCN): %@

# GlobalSynchronizationChannelNumberHint
source: Global Synchronization Channel Number (GSCN) Indicates the synchronization channel number used by the device when searching for and synchronizing with a 5G cell. This parameter helps determine how the device discovers and locks onto the serving NR cell.
zh_hans: 全局同步信道编号 Global Synchronization Channel Number(GSCN)用于表示设备在 5G 网络中搜索和同步基站时所使用的同步信道编号，该参数有助于确定设备如何发现并锁定当前 5G 小区。

source: Healthy
zh_hans: 健康

source: Help Test
zh_hans: 帮助测试

source: Help Test and Product Improvement
zh_hans: 帮助测试并改进产品

source: Hide
zh_hans: 隐藏

source: Hide No Permission Data
zh_hans: 隐藏无权限数据

source: Hide Now
zh_hans: 立即隐藏

# HotspotNotAuthenticated
source: Not Available, contact your carrier or check settings
zh_hans: 不可用，请联系运营商或检查设置

# IMSRegistrationBasicStatus
source: IMS Registration Status: %@
zh_hans: IMS注册状态: %@

# IMSRegistrationStatus
source: IMS Registration Status: Voice: %@ SMS: %@
zh_hans: IMS注册状态: 语音: %@ 短信: %@

source: Inactivity Timer
zh_hans: 不活跃计时器

source: Incompatible
zh_hans: 不兼容

source: Installable
zh_hans: 可安装

source: Installed IPCC
zh_hans: 已安装的IPCC

# InstalledIPCCFooterText
source: Swipe left to delete IPCC. Swipe right to export IPCC.
zh_hans: 向左滑动删除IPCC 向右滑动导出IPCC

source: Install IPCC
zh_hans: 安装IPCC

# InstallIPCCCanNotAccessFileMessage
source: Unable to access the current IPCC file, please try copying the file to another directory and then try again.
zh_hans: 无法访问当前IPCC文件，请尝试将该文件复制到其他目录后再试一次

# InstallIPCCFailedMessage
source: Installation of IPCC failed, please check the validity of the IPCC file and try again.
zh_hans: 安装IPCC失败，请检查IPCC文件的有效性后再试一次

# InstallIPCCFailedWithPathLockedMessage
source: IPCC installation failed. The installation directory is locked. Please unlock it and try again. Locked paths: %@
zh_hans: 安装IPCC失败，安装目录被锁定，请先解除锁定后再次安装 被锁定的目录: %@

# InstallIPCCSuccessfulMessage
source: The IPCC for %1$@ (version %2$@) was installed successfully. Please wait while the system refreshes the cellular network status.
zh_hans: %1$@ %2$@版本的IPCC安装成功，请等待系统刷新蜂窝网络状态

# InstallIPCCTips
source: ⚠️ Installing an IPCC file generally does not improve signal strength or network performance. Please ensure that the IPCC file is compatible with your device, carrier, and modem configuration. If the cellular plan is roaming, install the IPCC file for its home carrier instead of the current roaming network. An incompatible IPCC may result in incorrect carrier settings or no effect at all. Do not trust IPCC files from unofficial or unknown sources. This application does not provide or include any preloaded IPCC files. It is strongly recommended to extract IPCC files from official IPSW firmware to ensure integrity and compatibility. You do not need to worry about SIM slot selection, the system will automatically match the appropriate slot. Proceed with caution.
zh_hans: ⚠️ 安装 IPCC 文件通常不会提升信号强度或网络性能。 请确保所使用的 IPCC 文件与您的设备、运营商及基带配置相匹配。如果您的蜂窝数据卡正在漫游状态，请安装蜂窝数据卡归属运营商的IPCC文件，而非漫游网络的IPCC。 不兼容的 IPCC 可能导致运营商配置异常，或出现无服务，或完全无效果。 请勿轻信任何非官方或来源不明的 IPCC 文件，本应用程序未提供或预置任何 IPCC 文件。 建议您从官方 IPSW 固件中自行提取 IPCC，以确保其完整性与兼容性。 您无需关心安装的 IPCC 所在卡槽情况，系统会自动匹配相应的卡槽。 请谨慎操作。

# InstallIPCCUpgradedFailedMessage
source: The attempt to upgrade %1$@ from version %2$@ to %3$@ failed. The IPCC file may be incompatible with the current system version.
zh_hans: 尝试将%1$@从%2$@升级为%3$@失败，可能是当前版本IPCC文件不兼容当前系统版本

source: Install Path Access
zh_hans: 安装目录访问

# InstallPathLockedMessage
source: ⚠️ The system directory for IPCC installation is locked. The IPCC file cannot be installed successfully. It is recommended to unlock it before proceeding. Do you want to continue installation?
zh_hans: ⚠️安装IPCC的系统目录已被锁定，无法成功安装IPCC文件，建议解锁后再安装IPCC 是否继续安装?

# InstallRootHelperMessage
source: RootHelper was not detected. This feature requires RootHelper to be installed. Please download it from the project's GitHub releases page.
zh_hans: 未检测到RootHelper。此功能需要安装RootHelper后才可使用，请前往项目的GitHub下载并安装。

source: Install This IPCC
zh_hans: 安装此IPCC文件

# InterfaceCostExpensive
source: Expensive network: %@
zh_hans: 高成本网络: %@

source: Internet Connection State: %@
zh_hans: 网络连接状态: %@

source: Invalid
zh_hans: 未认证

# InvalidIPCCAfterInstallMessage
source: The installation of IPCC %1$@ (version %2$@) failed. This IPCC file may be corrupted or tampered with. The system has restored %3$@ to the default carrier bundle.
zh_hans: 安装%1$@ %2$@版本的IPCC失败 该IPCC文件可能损坏或被篡改 系统已将%3$@的IPCC版本还原为系统默认IPCC版本

source: Invalid IPCC file
zh_hans: 无效的IPCC文件

source: Invalid path
zh_hans: 非法路进化

source: IPCC Compatibility Check
zh_hans: IPCC兼容性检测

# IPCCDowngradedMessage
source: IPCC installation failed. Direct downgrade of the IPCC is not supported by the system. The carrier bundle for %1$@ has been restored to the default version. Version %2$@ has been removed by the system. To use version %3$@, please install this IPCC file again.
zh_hans: 安装IPCC失败，系统不支持直接降级IPCC版本。已将%1$@的IPCC恢复为系统默认版本。 %2$@版本的IPCC已被系统移除，如需使用%3$@版本，请再次安装该IPCC文件。

# IPCCFileBelowSystemVersionMessage
source: ⚠️ The selected IPCC version is lower than the system default. %1$@ IPCC file version: %2$@ This IPCC can be installed, but it will not be used by the system. It is not recommended to proceed.
zh_hans: ⚠️安装的IPCC文件版本低于当前系统默认IPCC版本 %1$@ IPCC文件版本: %2$@ 可以正常安装此IPCC，但是系统不会使用该IPCC文件，不建议继续安装此IPCC

# IPCCFileInfo
source: IPCC File information
zh_hans: IPCC文件信息

# IPCCFileNotSupportedDeviceMessage
source: ⚠️ The selected IPCC file is not compatible with this device. Current device logic board ID: %1$@ Supported logic board IDs in this IPCC: %2$@ This IPCC cannot be used on this device. Or the system cannot use this IPCC after successful installation. It is not recommended to proceed with installation.
zh_hans: ⚠️安装的IPCC文件与当前设备不兼容 当前设备主板编号: %1$@ IPCC文件兼容的主板编号: %2$@ 无法成功安装此IPCC, 或成功安装后系统无法使用此IPCC, 不建议继续安装此IPCC

# IPCCInstallFailed
source: Failed to install IPCC
zh_hans: 安装IPCC失败

source: IPCC Manager
zh_hans: IPCC管理

# IPCCSameVersionMessage
source: IPCC installation succeeded. Version %2$@ for %1$@ is already installed, so no changes were applied.
zh_hans: 安装IPCC成功，%1$@ %2$@版本已经安装过，因此系统不会刷新当前状态

# IPCCStagingFailed
source: Failed to stage IPCC
zh_hans: 处理IPCC文件失败

# IPCCUpgradedMessage
source: IPCC installation succeeded. The carrier bundle for %1$@ has been upgraded from version %2$@ to %3$@.
zh_hans: 安装IPCC成功，%1$@的IPCC版本已由%2$@版本升级为%3$@版本

source: IPv6 Compatibility
zh_hans: IPv6兼容模式

# isEnabledPlan
source: Plan: %@
zh_hans: 蜂窝数据卡: %@

# isInstallingPlan
source: Installing Plan: %@
zh_hans: 正在安装蜂窝数据卡: %@

source: Issue Detected
zh_hans: 检测到问题

# isTransferredPlan
source: Transferred Plan: %@
zh_hans: 已转移的蜂窝数据卡: %@

source: Label: %@
zh_hans: 标签: %@

source: Language Settings
zh_hans: 界面语言

# LastRegisteredNetworkMCC
source: Last Registered Network Mobile Country Code(MCC): %@
zh_hans: 上次注册网络的移动国家代码(MCC): %@

# LastRegisteredNetworkMNCCountryCode
source: Last Registered Network Mobile Country Code (MCC): %@
zh_hans: 上次注册网络的移动网络所属区域代码(MCC): %@

# LimitIPTrackingStatus
source: Limit IP Tracking: %@
zh_hans: 限制IP地址跟踪: %@

# LocationBack
source: Back
zh_hans: 背面

# LocationESIM
source: eSIM Chip
zh_hans: eSIM芯片

# LocationFront
source: Front
zh_hans: 正面

source: Locked
zh_hans: 有锁
